/*
    숫자 자료 : 3개 이상
        가격 1,500
        수량 1
        대기번호
    문자열 자료 : 3개 이상
        아메리카노, 원조카페, 카페모카, 얼음, 유료옵션
        주문 내용
        영수증 > 지점명 

        적립 휴대폰 번호 : 01000000000
        할인 바코드 번호 : 12345678910112

        스탬프 적립이나 멤버십 쿠폰 사용을 원하시면 선택해주세요.
        쿠폰 또는 복합 결제시 선택해 주세요.
        

    불리언 자료 : 3개 이상
        텀블러 사용
        영수증을 출력하시겠습니까? 예: 출력 / 아니오 : 미출력
        매장에서 먹어요 / 포장해서 갈래요

    배열 자료 : 3개 이상
        카테고리 : [커피, 음료, 주스/에이드, 빽스치노 ...]
        커피 [ 아메리카노, 원조커피, 카페모카 ...]
        유료옵션 [나타드코코추가, 아이스크림 토핑 추가, 탄산수 변경 ...]
        결제방식 [카드결제, 카카오페이, payco, npay ...]

*/

console.log( "숫자 : 가격, 수량, 대기번호" )
console.log( "문자열 : 음료명, 카테고리명, 지점명, 쿠폰번호")
console.log( "불리언 : 텀블러 사용유무, 영수증 출력 유무, 매장 취식 유무")
console.log( "배열 : 카테고리list, 음료 종류 list, 유료옵션 list, 결제방식")
